GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_core.c
/*
 * Copyright (c) 2019-2022 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv7m.h"
#include "stm32wb_system.h"
#include "stm32wb_lptim.h"

#include "rtos_api.h"
#include "rtos_core.h"

extern uint32_t __HeapBase[];
extern uint32_t __HeapLimit[];
extern uint32_t __StackTop[];
extern uint32_t __StackLimit[];

armv7m_rtos_control_t armv7m_rtos_control =
{
    .task_self = NULL,
    .task_next = NULL,
    .task_ready = NULL,
    .task_default = NULL,
    .task_link = K_TASK_SENTINEL,
    .task_resume = K_TASK_SENTINEL,
    .task_wakeup = K_TASK_SENTINEL,
    .task_timeout = NULL,
    .task_clock = 0,
    .task_timer = STM32WB_LPTIM_TIMEOUT_INIT(),
    .event_send = K_EVENT_SENTINEL,
    .sem_release = K_SEM_SENTINEL,
    .work_self = NULL,
    .work_head = K_WORK_SENTINEL,
    .work_tail = K_WORK_SENTINEL,
    .work_submit = K_WORK_SENTINEL,
    .alarm_queue = NULL,
    .alarm_modify = K_ALARM_SENTINEL,
    .alarm_clock = 0,
    .alarm_timer = STM32WB_LPTIM_TIMEOUT_INIT(),
    .system_state = K_STATE_INACTIVE,
    .system_policy = K_POLICY_SLEEP,
    .heap_current = (void*)&__HeapBase[0]
};
  
static k_task_t armv7m_rtos_task_default;

typedef struct _k_task_params_t {
    const char                  *name;
    k_task_routine_t            routine;
    void                        *context;
    uint32_t                    priority;
    void                        *stack_base;
    uint32_t                    stack_size;
    uint32_t                    options;
} k_task_params_t;

static void armv7m_rtos_system_initialize(const k_hook_table_t *hook_table);
static void armv7m_rtos_system_start(k_task_routine_t routine, void *context) __attribute__((noreturn));

static void armv7m_rtos_task_timeout_insert(k_task_t *task, uint64_t clock);
static void armv7m_rtos_task_timeout_callback(void *context);

static void * __svc_armv7m_rtos_heap_allocate(uint32_t size);

static void __svc_armv7m_rtos_system_start(k_task_routine_t routine, void *context);
static bool __svc_armv7m_rtos_system_lock(void);
static void __svc_armv7m_rtos_system_unlock(void);
static int __svc_armv7m_rtos_system_set_policy(uint32_t policy, uint32_t *p_policy_return);

       void __svc_armv7m_rtos_task_exit(void);

/******************************************************************************************************************************/

#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)

/*
 * RTT/SYSVIEW notes:
 *
 * - task_run(NULL) means switch to idle
 * - work_enter(work) means a switch to the WORK task (first one), work_exit() means switch back to current task 
 *
 * name/priority are just used for the GUI, to associate the "task" address with something readable, and to 
 * order things on screen.
 *
 * "stack_base" is displayed in HEX, while "stack_size" is displayed in dedcimal. So "stack_size" could be the total
 * size, or the used size, or the free size. So ideally it would be the maximum used size.
 *
 * So somewhere in the idle routine we'd want to go throu the list of stacks and check.
 */

static void armv7m_rtos_hook_task_create(k_task_t *task, const char *name, uint32_t priority, void *stack_base, uint32_t stack_size)
{
} 

static void armv7m_rtos_hook_task_destroy(k_task_t *task)
{
}

static void armv7m_rtos_hook_task_exit(void)
{
}

static void armv7m_rtos_hook_task_terminate(k_task_t *task)
{
}

static void armv7m_rtos_hook_task_block(k_task_t *task, uint32_t cause)
{
}

static void armv7m_rtos_hook_task_ready(k_task_t *task)
{
}

static void armv7m_rtos_hook_task_run(k_task_t *task)
{
}

static const k_hook_table_t armv7m_rtos_hook_table =
{
    .task_create    = armv7m_rtos_hook_task_create,
    .task_destroy   = armv7m_rtos_hook_task_destroy,
    .task_exit      = armv7m_rtos_hook_task_exit,      
    .task_terminate = armv7m_rtos_hook_task_terminate,
    .task_block     = armv7m_rtos_hook_task_block,
    .task_ready     = armv7m_rtos_hook_task_ready,
    .task_run       = armv7m_rtos_hook_task_run,
};

#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */


void __attribute__((naked, noreturn)) armv7m_rtos_pendsv_epilogue(void)
{
    __asm__(
        "1: movw     r3, #:lower16:armv7m_rtos_control         \n"
        "   movt     r3, #:upper16:armv7m_rtos_control         \n"
        "   ldr      r0, [r3, %[offset_CONTROL_WORK_SELF]]     \n"
        "   cbz.n    r0, 4f                                    \n"
        "   push     { r7, lr }                                \n"
        "   ldr      r1, [r0, %[offset_WORK_ROUTINE]]          \n"
        "   bic      r1, r1, #1                                \n"
        "   ldr      r2, [r0, %[offset_WORK_CONTEXT]]          \n"
        "   mov      r3, #0x01000000                           \n"
        "   mov      lr, #0xfffffff9                           \n"
        "   adr      r7, 2f                                    \n"
        "   orr      r7, r7, #1                                \n"
        "   sub      sp, #0x20                                 \n"
        "   str      r2, [sp, #0x00]                           \n"
        "   str      r7, [sp, #0x14]                           \n"
        "   str      r1, [sp, #0x18]                           \n"
        "   str      r3, [sp, #0x1c]                           \n"
        "   dsb                                                \n"
        "   bx       lr                                        \n"
        "   .align 2                                           \n"
        "2: cpsie    i                                         \n"
        "   adr      r7, 3f                                    \n"
        "   add      r7, #1                                    \n"
#if (__FPU_PRESENT == 1)
        "   mrs      r0, CONTROL                               \n"
        "   bic      r0, #0x04                                 \n" // clear FPCA 
        "   msr      CONTROL, r0                               \n"
#endif /* __FPU_PRESENT == 1 */
        "   svc      0                                         \n"
        "   .align 2                                           \n"
        "3: add      sp, #0x28                                 \n" // 32 bytes for the exception stack, 8 bytes for SVCALL frame
        "   bl       armv7m_rtos_work_return                   \n"
        "   pop      { r7, lr }                                \n"
        "   b.n      1b                                        \n"
        "   .align 2                                           \n"
        "4: ldr      r0, [r3, %[offset_CONTROL_TASK_NEXT]]     \n"
        "   ldr      r1, [r3, %[offset_CONTROL_TASK_SELF]]     \n"
        "   cmp      r0, r1                                    \n"
        "   bne.n    5f                                        \n"
        "   dsb                                                \n"
        "   bx       lr                                        \n"
        "5: cmp      r1, %[const_TASK_TERMINATED]              \n"
        "   bls.n    6f                                        \n"
        "   tst      lr, #0x00000004                           \n" // bit 2 is SPSEL
        "   itte     eq                                        \n"
        "   moveq    r2, sp                                    \n"
#if (__FPU_PRESENT == 1)
        "   subeq    sp, sp, #0x60                             \n"
#else  /* __FPU_PRESENT == 1 */
        "   subeq    sp, sp, #0x20                             \n"
#endif /* __FPU_PRESENT == 1 */
        "   mrsne    r2, PSP                                   \n"
        "   stmdb    r2!, { r4-r11 }                           \n"
#if (__FPU_PRESENT == 1)
        "   tst      lr, #0x00000010                           \n" // bit 4 is nFPCA
        "   it       eq                                        \n"
        "   vstmdbeq r2!, { d8-d15 }                           \n"
#endif /* __FPU_PRESENT == 1 */
        "   tst      lr, #0x00000004                           \n" // bit 2 is SPSEL
        "   it       eq                                        \n"
        "   moveq    sp, r2                                    \n"
        "   str      lr, [r1, %[offset_TASK_EXC_RETURN]]       \n"
        "   str      r2, [r1, %[offset_TASK_STACK_TOP]]        \n"
        "6: str      r0, [r3, %[offset_CONTROL_TASK_SELF]]     \n"
        "   cbz.n    r0, 7f                                    \n"
        "   ldr      lr, [r0, %[offset_TASK_EXC_RETURN]]       \n"
        "   ldr      r2, [r0, %[offset_TASK_STACK_TOP]]        \n"
#if (__FPU_PRESENT == 1)
        "   tst      lr, #0x00000010                           \n" // bit 4 is nFPCA
        "   it       eq                                        \n"
        "   vldmiaeq r2!, { d8-d15 }                           \n"
#endif /* __FPU_PRESENT == 1 */
        "   ldmia    r2!, { r4-r11 }                           \n"
        "   tst      lr, #0x00000004                           \n" // bit 2 is SPSEL
        "   ite      eq                                        \n"
        "   moveq    sp, r2                                    \n"
        "   msrne    PSP, r2                                   \n"
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
        "   ldr      r3, [r3, %[offset_CONTROL_HOOK_TABLE]]    \n"
        "   ldr      r3, [r3, %[offset_HOOK_TABLE_TASK_RUN]]   \n"
        "   bx       r3                                        \n"
#else /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
        "   dsb                                                \n"
        "   bx       lr                                        \n"
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
        "   .align 2                                           \n"
        "7: movw     r1, #:lower16:armv7m_rtos_idle_routine    \n"
        "   movt     r1, #:upper16:armv7m_rtos_idle_routine    \n"
        "   mov      r2, #0x01000000                           \n"
        "   mov      lr, #0xfffffff9                           \n"
        "   sub      sp, #0x20                                 \n"
        "   str      r1, [sp, #0x18]                           \n"
        "   str      r2, [sp, #0x1c]                           \n"
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
        "   ldr      r3, [r3, %[offset_CONTROL_HOOK_TABLE]]    \n"
        "   ldr      r3, [r3, %[offset_HOOK_TABLE_TASK_RUN]]   \n"
        "   bx       r3                                        \n"
#else /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
        "   dsb                                                \n"
        "   bx       lr                                        \n"
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
        :
        : [offset_CONTROL_WORK_SELF]        "I" (offsetof(armv7m_rtos_control_t, work_self)),
          [offset_CONTROL_TASK_SELF]        "I" (offsetof(armv7m_rtos_control_t, task_self)),
          [offset_CONTROL_TASK_NEXT]        "I" (offsetof(armv7m_rtos_control_t, task_next)),
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
          [offset_CONTROL_HOOK_TABLE]       "I" (offsetof(armv7m_rtos_control_t, hook_table)),
          [offset_HOOK_TABLE_TASK_RUN]      "I" (offsetof(k_hook_table_t, task_run)),
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
          [offset_TASK_EXC_RETURN]          "I" (offsetof(k_task_t, exc_return)),
          [offset_TASK_STACK_TOP]           "I" (offsetof(k_task_t, stack_top)),
          [offset_TASK_STACK_LIMIT]         "I" (offsetof(k_task_t, stack_limit)),
          [offset_WORK_ROUTINE]             "I" (offsetof(k_work_t, routine)),
          [offset_WORK_CONTEXT]             "I" (offsetof(k_work_t, context)),
          [const_TASK_TERMINATED]           "I" (K_TASK_TERMINATED),
          [const_WORK_SENTINEL]             "I" (K_WORK_SENTINEL)
        );
}

static void __attribute__((naked, used, noreturn)) armv7m_rtos_idle_routine(void)
{
    __asm__(
        "   movw     r3, #:lower16:armv7m_rtos_control         \n"
        "   movt     r3, #:upper16:armv7m_rtos_control         \n"
        "   ldrb     r0, [r3, %[offset_CONTROL_SYSTEM_POLICY]] \n"
        "   bl       stm32wb_system_sleep                      \n"
        "   adr      r7, 1f                                    \n"
        "   add      r7, #1                                    \n"
        "   svc      0                                         \n"
        "   .align 2                                           \n"
        "1: add      sp, #0x28                                 \n" // 32 bytes for the exception stack, 8 bytes for SVCALL frame
        "   movw     r3, #:lower16:armv7m_rtos_control         \n"
        "   movt     r3, #:upper16:armv7m_rtos_control         \n"
        "   ldr      r0, [r3, %[offset_CONTROL_TASK_READY]]    \n"
        "   str      r0, [r3, %[offset_CONTROL_TASK_NEXT]]     \n"        
        "   mov      r0, %[const_TASK_TERMINATED]              \n"
        "   str      r0, [r3, %[offset_CONTROL_TASK_SELF]]     \n"        
        "   b        armv7m_rtos_pendsv_epilogue               \n"
        :
        : [offset_CONTROL_SYSTEM_POLICY] "I" (offsetof(armv7m_rtos_control_t, system_policy)),
          [offset_CONTROL_TASK_SELF]     "I" (offsetof(armv7m_rtos_control_t, task_self)),
          [offset_CONTROL_TASK_NEXT]     "I" (offsetof(armv7m_rtos_control_t, task_next)),
          [offset_CONTROL_TASK_READY]    "I" (offsetof(armv7m_rtos_control_t, task_ready)),
          [const_TASK_TERMINATED]        "I" (K_TASK_TERMINATED)
        );
}

static void armv7m_rtos_system_initialize(const k_hook_table_t *hook_table)
{
    k_task_t *task;
    void *stack_base, *stack_limit;
    
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    armv7m_rtos_control.hook_table = hook_table ? hook_table : &armv7m_rtos_hook_table;
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */

    stack_base = (void*)&__StackTop[0];
    stack_limit = (void*)(((uint32_t)armv7m_rtos_control.heap_current + 31) & ~31);
    
