GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_core.c
    if (stack_limit < (void*)&__HeapLimit[0])
    {
        stack_limit = (void*)&__HeapLimit[0];
    }
    
    stack_limit += 32;
        
#if (ARMV7M_RTOS_MPU_SUPPORTED == 1)
    MPU->RBAR = (((uint32_t)stack_limit - 32) & 0xffffff00) | MPU_RBAR_VALID_Msk | (7 << MPU_RBAR_REGION_Pos);
    MPU->RASR = (MPU_RASR_SRD_Msk ^ ((1 << MPU_RASR_SRD_Pos) << ((((uint32_t)stack_limit - 32) & 0x000000ff) >> 5))) | (7 << MPU_RASR_SIZE_Pos) | MPU_RASR_ENABLE_Msk;
    MPU->CTRL = (MPU_CTRL_PRIVDEFENA_Msk | MPU_CTRL_HFNMIENA_Msk | MPU_CTRL_ENABLE_Msk);
    
    __DSB();
    __ISB();
#endif /* ARMV7M_RTOS_MPU_SUPPORTED == 1 */
        
    task = &armv7m_rtos_task_default;
    
    armv7m_rtos_control.task_default = task;
        
    armv7m_rtos_task_create(task, "DEFAULT", K_PRIORITY_MIN, stack_limit, (stack_base - stack_limit), K_TASK_JOINABLE);
    
    armv7m_rtos_control.system_state = K_STATE_READY;
}

static void __attribute__((naked, noreturn)) armv7m_rtos_system_start(k_task_routine_t routine, void *context)
{
    __asm__(
        "   cpsie    i                                         \n"
        "   adr      r7, 1f                                    \n"
        "   add      r7, #1                                    \n"
#if (__FPU_PRESENT == 1)
        "   mrs      r2, CONTROL                               \n"
        "   bic      r2, #0x04                                 \n" // clear FPCA
        "   msr      CONTROL, r2                               \n"
#endif /* __FPU_PRESENT == 1 */
        "   svc      0                                         \n"
        "   .align 2                                           \n"
        "1: sub      sp, #0x18                                 \n" // 0x20 from exception, 0x08 from SVCALL frame, so 0x18 needed
        "   bl       __svc_armv7m_rtos_system_start            \n"
        "   movw     r3, #:lower16:armv7m_rtos_control         \n"
        "   movt     r3, #:upper16:armv7m_rtos_control         \n"
        "   ldr      r0, [r3, %[offset_CONTROL_TASK_DEFAULT]]  \n"
        "   ldr      r2, [r0, %[offset_TASK_STACK_TOP]]        \n"
        "   mov      sp, r2                                    \n"
        "   b        armv7m_rtos_pendsv_epilogue               \n"
        :
        : [offset_CONTROL_TASK_DEFAULT]     "I" (offsetof(armv7m_rtos_control_t, task_default)),
          [offset_TASK_STACK_TOP]           "I" (offsetof(k_task_t, stack_top))
        );
}

void __attribute__((naked, noreturn)) armv7m_rtos_task_exit(void)
{
    __asm__(
        "   cpsie    i                                         \n"
        "   adr      r7, 1f                                    \n"
        "   add      r7, #1                                    \n"
#if (__FPU_PRESENT == 1)
        "   mrs      r2, CONTROL                               \n"
        "   bic      r2, #0x04                                 \n" // clear FPCA
        "   msr      CONTROL, r2                               \n"
#endif /* __FPU_PRESENT == 1 */
        "   svc      0                                         \n"
        "   .align 2                                           \n"
        "1: add      sp, #0x08                                 \n" // 8 bytes for SVCALL frame
        "   bl       __svc_armv7m_rtos_task_exit               \n"
        "   b        armv7m_rtos_pendsv_epilogue               \n"
        :
        :
        );
}

static void armv7m_rtos_task_status(k_task_t *task, uint32_t status)
{
#if (__FPU_PRESENT == 1)
    if (!(task->exc_return & 0x00000010))
    {
        ((armv7m_context_fpu_t*)task->stack_top)->r0 = status;
    }
    else
#endif /* __FPU_PRESENT == 1 */
    {
        ((armv7m_context_t*)task->stack_top)->r0 = status;
    }
}

/******************************************************************************************************************************/

void __attribute__((optimize("O3"), noinline)) armv7m_rtos_task_queue_insert(k_task_t **p_task_head, k_task_t *task)
{
    k_task_t *element;

    if (*p_task_head == NULL)
    {
        *p_task_head = task;

        task->next = task;
        task->previous = task;
    }
    else
    {
        element = *p_task_head;

        do
        {
            if (task->priority < element->priority)
            {
                if (*p_task_head == element)
                {
                    *p_task_head = task;
                }
                
                break;
            }

            element = element->next;
        }
        while (*p_task_head != element);

        task->next = element;
        task->previous = element->previous;
        
        task->previous->next = task;
        task->next->previous = task;
    }
}

void __attribute__((optimize("O3"), noinline)) armv7m_rtos_task_queue_remove(k_task_t **p_task_head, k_task_t *task)
{
    if (task->next == task)
    {
        *p_task_head = NULL;
    }
    else
    {
        if (*p_task_head == task)
        {
            *p_task_head = task->next;
        }
        
        task->next->previous = task->previous;
        task->previous->next = task->next;
    }

    task->next = NULL;
    task->previous = NULL;
}

void armv7m_rtos_task_ready_insert(k_task_t *task)
{
    task->state |= K_TASK_STATE_READY;

    armv7m_rtos_task_queue_insert(&armv7m_rtos_control.task_ready, task);
}

void armv7m_rtos_task_ready_remove(k_task_t *task)
{
    task->state &= ~K_TASK_STATE_READY;

    armv7m_rtos_task_queue_remove(&armv7m_rtos_control.task_ready, task);
}

void armv7m_rtos_task_start(k_task_t *task, k_task_routine_t routine, void *context)
{
    armv7m_context_t *stack;
    
    stack = (armv7m_context_t*)((uint32_t)task->stack_top - sizeof(armv7m_context_t));
    stack->r0 = (uint32_t)context;
#if (ARMV7M_RTOS_DEBUG_SUPPORTED == 1)
    stack->r1 = 0x00000000;
    stack->r2 = 0x00000000;
    stack->r3 = 0x00000000;
    stack->r4 = 0x00000000;
    stack->r5 = 0x00000000;
    stack->r6 = 0x00000000;
    stack->r7 = 0x00000000;
    stack->r8 = 0x00000000;
    stack->r9 = 0x00000000;
    stack->r10 = 0x00000000;
    stack->r11 = 0x00000000;
#endif /* (ARMV7M_RTOS_DEBUG_SUPPORTED == 1) */
    stack->lr = (uint32_t)armv7m_rtos_task_exit;
    stack->pc = (uint32_t)routine & ~1;
    stack->xpsr = 0x01000000;
    
    task->exc_return = ((task == armv7m_rtos_control.task_default) ? 0xfffffff9 : 0xfffffffd);
    task->stack_top = (void*)stack;
    task->stack_end = (void*)stack;

    if (!(task->state & K_TASK_STATE_SUSPENDED))
    {
        armv7m_rtos_task_ready_insert(task);
      
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
        (*armv7m_rtos_control.hook_table->task_ready)(task);
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
    }
}

void armv7m_rtos_task_create(k_task_t *task, const char *name, uint32_t priority, void *stack_base, uint32_t stack_size, uint32_t options)
{
    uint32_t *stack, *stack_e;

    task->next = NULL;
    task->previous = NULL;
    task->priority = priority;
    task->bpriority = priority;
    task->state = 0;
    task->events = 0;
    task->name = name;
    task->link = armv7m_rtos_control.task_link;
    task->exc_return = 0;
    task->stack_top = stack_base + stack_size;
    task->stack_end = stack_base + stack_size;
    task->stack_base = stack_base + stack_size;
    task->stack_limit = stack_base;
    task->join = NULL;
    task->mutex = NULL;
    task->resume = NULL;
    task->wakeup = NULL;
    task->timeout.next = NULL;
    task->timeout.previous = NULL;
    task->timeout.clock_l = 0;
    task->timeout.clock_h = 0;
    
