GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_core.c
    armv7m_rtos_control.task_link = task;

    if (options & K_TASK_JOINABLE)
    {
        task->state |= K_TASK_STATE_JOINABLE;
    }

    if (options & K_TASK_SUSPENDED)
    {
        task->state |= K_TASK_STATE_SUSPENDED;
    }
    
    if (task == armv7m_rtos_control.task_default)
    {
        stack_e = (uint32_t*)((uint32_t)__builtin_frame_address(0) & ~31) - 32;
    }
    else
    {
        stack_e = (uint32_t*)task->stack_end;
    }
    
    for (stack = (uint32_t*)task->stack_limit; stack < stack_e; stack += 2)
    {
        stack[0] = 0xaaaaaaaa;
        stack[1] = 0x77777777;
    }

#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    (*armv7m_rtos_control.hook_table->task_create)(task, task->name, task->priority, task->stack_limit, (task->stack_base - task->stack_limit));
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */

    if (task->state & K_TASK_STATE_SUSPENDED)
    {
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
        (*armv7m_rtos_control.hook_table->task_block)(task, K_TASK_STATE_SUSPENDED);
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
    }
}

void armv7m_rtos_task_destroy(k_task_t *task)
{
    k_task_t **p_task_previous, *task_link;
    
    for (p_task_previous = &armv7m_rtos_control.task_link, task_link = armv7m_rtos_control.task_link; task_link != K_TASK_SENTINEL; p_task_previous = &task_link->link, task_link = task_link->link)
    {
        if (task_link == task)
        {
            *p_task_previous = task->link;

            break;
        }
    }

    task->state = 0;
    task->link = NULL;

#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    (*armv7m_rtos_control.hook_table->task_destroy)(task);
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
}

void armv7m_rtos_task_release(k_task_t *task)
{
    if (task->state & K_TASK_STATE_TIMEOUT)
    {
        armv7m_rtos_task_timeout_remove(task);
    }
    
    task->state &= ~(K_TASK_STATE_EVENT_ALL | K_TASK_STATE_EVENT_CLEAR | K_TASK_STATE_WAIT_MASK);

    if (!(task->state & K_TASK_STATE_TERMINATED))
    {
        if (!(task->state & K_TASK_STATE_SUSPENDED))
        {
            armv7m_rtos_task_ready_insert(task);
            
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
            (*armv7m_rtos_control.hook_table->task_ready)(task);
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
        }
    }
}

void armv7m_rtos_task_unblock(k_task_t *task, uint32_t status)
{
    armv7m_rtos_task_status(task, status);

    switch (task->state & K_TASK_STATE_WAIT_MASK) {
    case K_TASK_STATE_WAIT_NONE:
        break;

    case K_TASK_STATE_WAIT_JOIN:
        armv7m_rtos_join_unblock(task);
        break;

    case K_TASK_STATE_WAIT_DELAY:
        armv7m_rtos_delay_unblock(task);
        break;

    case K_TASK_STATE_WAIT_SLEEP:
        armv7m_rtos_sleep_unblock(task);
        break;
            
    case K_TASK_STATE_WAIT_EVENT:
        armv7m_rtos_event_unblock(task);
        break;
            
    case K_TASK_STATE_WAIT_SEM:
        armv7m_rtos_sem_unblock(task);
        break;
            
    case K_TASK_STATE_WAIT_MUTEX:
        armv7m_rtos_mutex_unblock(task);
        break;
            
    default:
        break;
    }

    armv7m_rtos_task_release(task);
}

void armv7m_rtos_task_priority(k_task_t *task)
{
    k_task_t *task_next;
    k_mutex_t *mutex;
    uint32_t priority;

    do
    {
        task_next = NULL;

        priority = task->bpriority;

        mutex = task->mutex;

        if (mutex)
        {
            if (mutex->options & (K_MUTEX_PRIORITY_INHERIT | K_MUTEX_PRIORITY_PROTECT))
            {
                if (priority > mutex->priority)
                {
                    priority = mutex->priority;
                }
            }
        }
    
        if (task->priority != priority)
        {
            task->priority = priority;

            if (task->state & K_TASK_STATE_READY)
            {
                armv7m_rtos_task_ready_remove(task);
                armv7m_rtos_task_ready_insert(task);
            }

            task_next = armv7m_rtos_mutex_priority(task);
        }

        task = task_next;
    }
    while (task);
}

void armv7m_rtos_task_schedule(void)
{
    if (armv7m_rtos_control.system_state == K_STATE_RUNNING)
    {
        if (armv7m_rtos_control.task_next != armv7m_rtos_control.task_ready)
        {
            /* Do not switch away from the idle_routine. That is handled within the idle
             * reoutine.
             */

            if (armv7m_rtos_control.task_self)
            {
                armv7m_rtos_control.task_next = armv7m_rtos_control.task_ready;
                
                if (armv7m_rtos_control.task_self != armv7m_rtos_control.task_next)
                {
                    if (!armv7m_rtos_control.work_self)
                    {
                        armv7m_pendsv_hook(armv7m_rtos_pendsv_epilogue);
                    }
                }
            }
            else
            {
                stm32wb_system_wakeup();
            }
        }
    }
}

static void armv7m_rtos_task_timeout_insert(k_task_t *task, uint64_t clock)
{
    k_task_t *task_timeout;
    uint64_t timeout_clock;

    if (armv7m_rtos_control.task_timeout == NULL)
    {
        armv7m_rtos_control.task_timeout = task;

	task->timeout.next = task;
	task->timeout.previous = task;
    }
    else
    {
	task_timeout = armv7m_rtos_control.task_timeout;

	do
	{
            timeout_clock = (((uint64_t)task_timeout->timeout.clock_l << 0) | ((uint64_t)task_timeout->timeout.clock_h << 32));

            if (clock < timeout_clock)
            {
                if (task_timeout == armv7m_rtos_control.task_timeout)
                {
                    armv7m_rtos_control.task_timeout = task;
                }
                break;
            }
            
	    task_timeout = task_timeout->timeout.next;
	}
	while (task_timeout != armv7m_rtos_control.task_timeout);
        
        task->timeout.previous = task_timeout->timeout.previous;
        task->timeout.next = task_timeout;
            
        task->timeout.previous->timeout.next = task;
        task->timeout.next->timeout.previous = task;
    }

    task->timeout.clock_l = (uint32_t)(clock >> 0);
    task->timeout.clock_h = (uint32_t)(clock >> 32);

