GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_core.c
    task->state |= K_TASK_STATE_TIMEOUT;
}

void armv7m_rtos_task_timeout_remove(k_task_t *task)
{
    task->state &= ~K_TASK_STATE_TIMEOUT;

    if (task->timeout.next == task)
    {
        armv7m_rtos_control.task_timeout = NULL;
    }
    else
    {
        if (armv7m_rtos_control.task_timeout == task)
        {
            armv7m_rtos_control.task_timeout = task->timeout.next;
        }

        task->timeout.next->timeout.previous = task->timeout.previous;
        task->timeout.previous->timeout.next = task->timeout.next;
    }

    task->timeout.next = NULL;
    task->timeout.previous = NULL;
}

void armv7m_rtos_task_timeout_absolute(k_task_t *task, uint64_t clock)
{
    uint32_t seconds, millis;

    seconds = clock / 1000;
    millis = clock - seconds * 1000;

    clock = (((uint64_t)seconds * (uint64_t)STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND) + ((millis * STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND + 999) / 1000));

    armv7m_rtos_task_timeout_insert(task, clock);

    armv7m_rtos_task_timeout_schedule();
}

static void armv7m_rtos_task_timeout_callback(void *context)
{
    k_task_t *task;
    uint64_t clock, reference;

    task = armv7m_rtos_control.task_timeout;

    if (task)
    {
        reference = stm32wb_lptim_timeout_clock();

	do
	{
	    clock = (((uint64_t)task->timeout.clock_l << 0) | ((uint64_t)task->timeout.clock_h << 32));
		
            if (clock > reference)
            {
                break;
            }

            armv7m_rtos_task_unblock(task, (((task->state & K_TASK_STATE_WAIT_MASK) == K_TASK_STATE_WAIT_DELAY) ? K_NO_ERROR : K_ERR_TIMEOUT));
            
            task = armv7m_rtos_control.task_timeout;
	}
	while (task);

        armv7m_rtos_task_timeout_schedule();
    
        armv7m_rtos_task_schedule();
    }
}

void armv7m_rtos_task_timeout_relative(k_task_t *task, uint32_t delay)
{
    uint64_t clock;
    uint32_t seconds, millis;

    clock = stm32wb_lptim_timeout_clock();

    if (delay <= ((0xffffffff - 999) / STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND))
    {
        clock += ((delay * STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND + 999) / 1000);
    }
    else
    {
        seconds = delay / 1000;
        millis = delay - seconds * 1000;

        clock += (((uint64_t)seconds * (uint64_t)STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND) + ((millis * STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND + 999) / 1000));
    }
    
    armv7m_rtos_task_timeout_insert(task, clock);

    armv7m_rtos_task_timeout_schedule();
}

void armv7m_rtos_task_timeout_schedule(void)
{
    k_task_t *task;
    uint64_t clock;
    
    task = armv7m_rtos_control.task_timeout;

    if (task)
    {
        clock = (((uint64_t)task->timeout.clock_l << 0) | ((uint64_t)task->timeout.clock_h << 32));

        if (armv7m_rtos_control.task_clock != clock)
        {
            armv7m_rtos_control.task_clock = clock;

            stm32wb_lptim_timeout_absolute(&armv7m_rtos_control.task_timer, clock, armv7m_rtos_task_timeout_callback, NULL);
        }
    }
    else
    {
        if (armv7m_rtos_control.task_clock)
        {
            armv7m_rtos_control.task_clock = 0;

            stm32wb_lptim_timeout_cancel(&armv7m_rtos_control.task_timer);
        }
    }
}

/******************************************************************************************************************************/

static void * __svc_armv7m_rtos_heap_allocate(uint32_t size)
{
    k_task_t *task;
    void *heap_current, *heap_limit, *stack_limit;

    // armv7m_rtt_printf("k_heap_allocate(size=%d)\n", size);
    
    heap_current = armv7m_rtos_control.heap_current;
    heap_limit = &__StackLimit[0];

    if (size > (uint32_t)(heap_limit - heap_current))
    {
        return NULL;
    }

    task = armv7m_rtos_control.task_default;

    if (task)
    {
        stack_limit = (void*)(((uint32_t)(heap_current + size) + 31) & ~31) + 32;

        if (task->stack_limit < stack_limit)
        {
            if ((((uint32_t*)stack_limit)[-8] != 0xaaaaaaaa) ||
                (((uint32_t*)stack_limit)[-7] != 0x77777777) ||
                (((uint32_t*)stack_limit)[-6] != 0xaaaaaaaa) ||
                (((uint32_t*)stack_limit)[-5] != 0x77777777) ||
                (((uint32_t*)stack_limit)[-4] != 0xaaaaaaaa) ||
                (((uint32_t*)stack_limit)[-3] != 0x77777777) ||
                (((uint32_t*)stack_limit)[-2] != 0xaaaaaaaa) ||
                (((uint32_t*)stack_limit)[-1] != 0x77777777))
            {
                return NULL;
            }

            task->stack_limit = stack_limit;
        
#if (ARMV7M_RTOS_MPU_SUPPORTED == 1)
            MPU->RBAR = (((uint32_t)stack_limit - 32) & 0xffffff00) | MPU_RBAR_VALID_Msk | (7 << MPU_RBAR_REGION_Pos);
            MPU->RASR = (MPU_RASR_SRD_Msk ^ ((1 << MPU_RASR_SRD_Pos) << ((((uint32_t)stack_limit - 32) & 0x000000ff) >> 5))) | (7 << MPU_RASR_SIZE_Pos) | MPU_RASR_ENABLE_Msk;
#endif /* ARMV7M_RTOS_MPU_SUPPORTED == 1 */
        }
    }
    
    armv7m_rtos_control.heap_current += size;

    return heap_current;
}

static void  __attribute__((used)) __svc_armv7m_rtos_system_start(k_task_routine_t routine, void *context)
{
    if (routine)
    {
        armv7m_rtos_task_start(armv7m_rtos_control.task_default, routine, context);
    }
    
    armv7m_rtos_control.system_state = K_STATE_RUNNING;

    /* No special dispatch needed, as this case is handled via armv7m_rtos_system_start.
     * That code on the tail end call armv7m_rtos_pendsv_callback, to avoid cycling 
     * throu PENDSV and possibly fetching a bad exception frame off the stack.
     */

    armv7m_rtos_control.task_self = K_TASK_TERMINATED;
    armv7m_rtos_control.task_next = armv7m_rtos_control.task_ready;

    armv7m_rtos_work_schedule();
}

static bool __svc_armv7m_rtos_system_lock(void)
{
    uint8_t system_state;

    system_state = armv7m_rtos_control.system_state;
    
    if (!armv7m_rtos_control.work_self)
    {
        if (system_state == K_STATE_RUNNING)
        {
            armv7m_rtos_control.system_state = K_STATE_LOCKED;
        }
    }

