GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_core.c
    return (system_state == K_STATE_LOCKED);
}

static void __svc_armv7m_rtos_system_unlock(void)
{
    if (!armv7m_rtos_control.work_self)
    {
        if (armv7m_rtos_control.system_state == K_STATE_LOCKED)
        {
            armv7m_rtos_control.system_state = K_STATE_RUNNING;
            
            armv7m_rtos_task_schedule();

            armv7m_rtos_work_schedule();
        }
    }
}

static int __svc_armv7m_rtos_system_set_policy(uint32_t policy, uint32_t *p_policy_return)
{
    uint32_t policy_previous;

    if (policy > K_POLICY_STOP)
    {
        return K_ERR_INVALID_PARAMETER;
    }
    
    if (policy == K_POLICY_CURRENT)
    {
        policy_previous = armv7m_rtos_control.system_policy;
    }
    else
    {
        policy_previous = __armv7m_atomic_swapb(&armv7m_rtos_control.system_policy, policy);
    }

    if (p_policy_return)
    {
        *p_policy_return = policy_previous;
    }

    return K_NO_ERROR;
}

/* static */ void __svc_armv7m_rtos_task_exit(void)
{
    k_task_t *self;

    // armv7m_rtt_printf("k_task_exit()\n");
    
    self = armv7m_rtos_control.task_self;

    self->state |= K_TASK_STATE_TERMINATED;

    armv7m_rtos_task_ready_remove(self);
    
    if (self->join)
    {
        armv7m_rtos_join_release(self->join);
    }

    armv7m_rtos_mutex_destroy(self);

#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    (*armv7m_rtos_control.hook_table->task_exit)();
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
    
    if (!(self->state & K_TASK_STATE_JOINABLE))
    {
        armv7m_rtos_task_destroy(self);
    }

    /* No special dispatch needed, as this case is handled via armv7m_rtos_task_exit.
     * That code on the tail end call armv7m_rtos_pendsv_callback, to avoid cycling 
     * throu PENDSV and possibly fetching a bad exception frame off the stack.
     */

    armv7m_rtos_control.task_self = K_TASK_TERMINATED;
    armv7m_rtos_control.task_next = armv7m_rtos_control.task_ready;

    if (armv7m_rtos_control.system_state == K_STATE_LOCKED)
    {
        armv7m_rtos_control.system_state = K_STATE_RUNNING;

        armv7m_rtos_work_schedule();
    }
}

/******************************************************************************************************************************/

void* k_heap_allocate(uint32_t size)
{

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_armv7m_rtos_heap_allocate(size);
    }

    if (!armv7m_core_is_in_interrupt())
    {
        return (void*)armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_heap_allocate, (uint32_t)size);
    }

    return NULL;
}

uint64_t k_system_clock(void)
{
    uint64_t clock;
    uint32_t seconds, ticks;
    
    clock = stm32wb_lptim_timeout_clock();

    seconds = clock / STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND;
    ticks = clock & (STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND -1);

    return ((uint64_t)(seconds * 1000) + ((ticks * 1000) / STM32WB_LPTIM_TIMEOUT_TICKS_PER_SECOND));
}

uint32_t k_system_state(void)
{
    return armv7m_rtos_control.system_state;
}

int k_system_initialize(const k_hook_table_t *hook_table)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    if (armv7m_rtos_control.system_state != K_STATE_INACTIVE)
    {
        return K_ERR_ILLEGAL_USE;
    }

    armv7m_rtos_system_initialize(hook_table);

    return K_NO_ERROR;
}

int k_system_start(k_task_routine_t routine, void *context)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    if (armv7m_rtos_control.system_state != K_STATE_READY)
    {
        return K_ERR_ILLEGAL_USE;
    }

    armv7m_rtos_system_start(routine, context);
}

bool k_system_lock(void)
{
    if (!armv7m_core_is_in_thread())
    {
        return (armv7m_rtos_control.system_state == K_STATE_LOCKED);
    }

    if (armv7m_core_is_in_interrupt())
    {
        return __svc_armv7m_rtos_system_lock();
    }
    else
    {
        return armv7m_svcall_0((uint32_t)&__svc_armv7m_rtos_system_lock);
    }
}

void k_system_unlock(void)
{
    if (!armv7m_core_is_in_thread())
    {
        return;
    }
          
    if (armv7m_core_is_in_interrupt())
    {
        __svc_armv7m_rtos_system_unlock();
    }
    else
    {
        armv7m_svcall_0((uint32_t)&__svc_armv7m_rtos_system_unlock);
    }
}

bool k_system_is_locked(void)
{
    return (armv7m_rtos_control.system_state == K_STATE_LOCKED);
}

int k_system_set_policy(uint32_t policy, uint32_t *p_policy_return)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_2((uint32_t)&__svc_armv7m_rtos_system_set_policy, (uint32_t)policy, (uint32_t)p_policy_return);
}

/******************************************************************************************************************************/

void __attribute__((weak)) armv7m_rtos_join_release(k_task_t *task)
{
}

void __attribute__((weak)) armv7m_rtos_join_unblock(k_task_t *task)
{
}

void __attribute__((weak)) armv7m_rtos_delay_unblock(k_task_t *task)
{
}

void __attribute__((weak)) armv7m_rtos_sleep_unblock(k_task_t *task)
{
}

void __attribute__((weak)) armv7m_rtos_event_unblock(k_task_t *task)
{
}

void __attribute__((weak)) armv7m_rtos_sem_unblock(k_task_t *task)
{
}

k_task_t * __attribute__((weak)) armv7m_rtos_mutex_priority(k_task_t *task)
{
    return NULL;
}

void __attribute__((weak)) armv7m_rtos_mutex_unblock(k_task_t *task)
{
}

void __attribute__((weak)) armv7m_rtos_mutex_destroy(k_task_t *task)
{
}

void __attribute__((weak)) armv7m_rtos_work_return(void)
{
}

void __attribute__((weak)) armv7m_rtos_work_schedule(void)
{
}

/******************************************************************************************************************************/
